import time
  
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  #~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    #~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#~ менеджер для измерения времени операций
class TaskTimer:
  #~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  def __init__(self):
    self.init_timer()

  #~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  #~ инициализация таймера
  def init_timer(self):
    #~ фиксация времени старта процесса
    self.t = time.time()

  #~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  #~ затраченное время на выполнение всей операции/процесса
  def elapsed_time(self):
    # Расчет времени выполнения
    result_time = time.time()-self.t
    hour = int(result_time//3600)
    min = int(result_time//60)-hour*60
    sec = int(round(result_time%60))
    msec = round(1000*result_time%60)
    #~~~~~~~~~~~~~~~~~~~~~~~~
    print('='*70)
    if hour > 0:
      print('Время обработки: ' + str(hour)+' час. ' + str(min)+' мин.')
    elif min > 0:
      print('Время обработки: ' + str(min)+' мин. ' + str(sec)+' сек.')
    elif sec > 0:
      print('Время обработки: ' + str(sec)+' сек.')
    else:
      print('Время обработки: ' + str(msec)+' мс.')
    print('='*70)
    #~~~~~~~~~~~~~~~~~~~~~~~~
  